import { toDakuon } from '../src'

describe('toDakuon', () => {
  const testData =
    'かきくけこ さしすせそ たちつてと はひふへほ ぱぴぷぺぽ カキクケコ サシスセソ タチツテト ハヒフヘホ パピプペポ'
  test('全て', () => {
    expect(toDakuon(testData)).toBe(
      'がぎぐげご ざじずぜぞ だぢづでど ばびぶべぼ ばびぶべぼ ガギグゲゴ ザジズゼゾ ダヂヅデド バビブベボ バビブベボ'
    )
  })

  test('ひらがなのみ', () => {
    expect(
      toDakuon(testData, {
        onlyHiragana: true
      })
    ).toBe(
      'がぎぐげご ざじずぜぞ だぢづでど ばびぶべぼ ばびぶべぼ カキクケコ サシスセソ タチツテト ハヒフヘホ パピプペポ'
    )
  })

  test('カタカナのみ', () => {
    expect(
      toDakuon(testData, {
        onlyKatakana: true
      })
    ).toBe(
      'かきくけこ さしすせそ たちつてと はひふへほ ぱぴぷぺぽ ガギグゲゴ ザジズゼゾ ダヂヅデド バビブベボ バビブベボ'
    )
  })

  test('ignoreList', () => {
    expect(
      toDakuon(testData, {
        ignoreList: [
          'か',
          'き',
          'く',
          'け',
          'こ',
          'さ',
          'し',
          'す',
          'せ',
          'そ',
          'た',
          'ち',
          'つ',
          'て',
          'と',
          'は',
          'ひ',
          'ふ',
          'へ',
          'ほ',
          'ぱ',
          'ぴ',
          'ぷ',
          'ぺ',
          'ぽ',
          'カ',
          'キ',
          'ク',
          'ケ',
          'コ',
          'サ',
          'シ',
          'ス',
          'セ',
          'ソ',
          'タ',
          'チ',
          'ツ',
          'テ',
          'ト',
          'ハ',
          'ヒ',
          'フ',
          'ヘ',
          'ホ',
          'パ',
          'ピ',
          'プ',
          'ペ',
          'ポ'
        ]
      })
    ).toBe(
      'かきくけこ さしすせそ たちつてと はひふへほ ぱぴぷぺぽ カキクケコ サシスセソ タチツテト ハヒフヘホ パピプペポ'
    )
  })
})
